attacker145/NRF51822v01/examples/ble_peripheral/ble_app_uart/pca10028/s130/arm5_no_packs/nrf_adc.c
/* Copyright (c) 2015 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */

/** @file
 * @defgroup nrf_adc_example main.c
 * @{
 * @ingroup nrf_adc_example
 * @brief ADC Example Application main file.
 *
 * This file contains the source code for a sample application using the ADC driver.
 */
 
#include "nrf.h"
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
//#include "nrf_drv_adc.h"
#include "nrf_drv_adc_Rev01.h"
#include "nordic_common.h"
#include "boards.h"
#include "nrf_log.h"
#include "app_error.h"
#include "nrf_delay.h"
#include "app_util_platform.h"


#define ADC_BUFFER_SIZE 10                                /**< Size of buffer for ADC samples.  */
//static nrf_adc_value_t       adc_buffer[ADC_BUFFER_SIZE]; /**< ADC buffer. */
static nrf_drv_adc_channel_t m_channel_config = NRF_DRV_ADC_DEFAULT_CHANNEL(NRF_ADC_CONFIG_INPUT_2); /**< Channel instance. Default configuration used. P0.01 - AIN2 nRF51822 PS page 12*/

/**
 * @brief ADC interrupt handler.
 */
static void adc_event_handler(nrf_drv_adc_evt_t const * p_event)
{
    if (p_event->type == NRF_DRV_ADC_EVT_DONE)
    {
        uint32_t i;
        for (i = 0; i < p_event->data.done.size; i++)
        {
            NRF_LOG_PRINTF("Current sample value: %d\r\n", p_event->data.done.p_buffer[i]);
        }
    }
}

/**
 * @brief ADC initialization.
 */
//static void adc_config(void)
void adc_config(void)
{
    ret_code_t ret_code;
    nrf_drv_adc_config_t config = NRF_DRV_ADC_DEFAULT_CONFIG;

    ret_code = nrf_drv_adc_init(&config, adc_event_handler);
    APP_ERROR_CHECK(ret_code);

    nrf_drv_adc_channel_enable(&m_channel_config);
}

/**
 * @brief Function for main application entry.
 */
/*
void adc_read_sample(void)
{
//    LEDS_CONFIGURE(BSP_LED_0_MASK);
//    LEDS_OFF(BSP_LED_0_MASK);

			//adc_config();
//    UNUSED_RETURN_VALUE(NRF_LOG_INIT());

//    NRF_LOG_PRINTF("ADC example\r\n");

//    while (true)
//    {
        APP_ERROR_CHECK(nrf_drv_adc_buffer_convert(adc_buffer,ADC_BUFFER_SIZE)); // Fill up the data buffer
        uint32_t i;
        for (i = 0; i < ADC_BUFFER_SIZE; i++)
        {
//            // manually trigger ADC conversion
            nrf_drv_adc_sample();
//            // enter into sleep mode
            __SEV();
            __WFE();
            __WFE();

            nrf_delay_ms(100);
//            LEDS_INVERT(BSP_LED_0_MASK);
        }
//    }
}*/
/** @} */
